tutorials/compressible/explicitRhoFoam/forwardStep/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

compressible
{
    fluxIntegrator   RK45;
    fluxScheme       HLLC;
}

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         leastSquares;
}

divSchemes
{
    default         none;
    div((thermo:mu*dev2(T(grad(U)))))   Gauss linear;

}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default             cubic;
    reconstruct(U)      vanLeerV;
    reconstruct(H)      vanLeer;
    reconstruct(p)      vanLeer;
    reconstruct(rho)    vanLeer;
    reconstruct(gamma)  vanLeer;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
